{
  "model_index.json": {
    "_class_name": "SanaSprintPipeline",
    "_diffusers_version": "0.33.0.dev0",
    "scheduler": [
      "diffusers",
      "SCMScheduler"
    ],
    "text_encoder": [
      "transformers",
      "Gemma2Model"
    ],
    "tokenizer": [
      "transformers",
      "GemmaTokenizerFast"
    ],
    "transformer": [
      "diffusers",
      "SanaTransformer2DModel"
    ],
    "vae": [
      "diffusers",
      "AutoencoderDC"
    ]
  },
  "transformer/config.json": {
    "_class_name": "SanaTransformer2DModel",
    "_diffusers_version": "0.33.0.dev0",
    "attention_bias": false,
    "attention_head_dim": 32,
    "caption_channels": 2304,
    "cross_attention_dim": 1152,
    "cross_attention_head_dim": 72,
    "dropout": 0.0,
    "guidance_embeds": true,
    "guidance_embeds_scale": 0.1,
    "in_channels": 32,
    "interpolation_scale": null,
    "mlp_ratio": 2.5,
    "norm_elementwise_affine": false,
    "norm_eps": 1e-06,
    "num_attention_heads": 36,
    "num_cross_attention_heads": 16,
    "num_layers": 28,
    "out_channels": 32,
    "patch_size": 1,
    "qk_norm": "rms_norm_across_heads",
    "sample_size": 32,
    "timestep_scale": 1.0
  },
  "vae/config.json": {
    "_class_name": "AutoencoderDC",
    "_diffusers_version": "0.33.0.dev0",
    "_name_or_path": "mit-han-lab/dc-ae-f32c32-sana-1.1-diffusers",
    "attention_head_dim": 32,
    "decoder_act_fns": "silu",
    "decoder_block_out_channels": [
      128,
      256,
      512,
      512,
      1024,
      1024
    ],
    "decoder_block_types": [
      "ResBlock",
      "ResBlock",
      "ResBlock",
      "EfficientViTBlock",
      "EfficientViTBlock",
      "EfficientViTBlock"
    ],
    "decoder_layers_per_block": [
      3,
      3,
      3,
      3,
      3,
      3
    ],
    "decoder_norm_types": "rms_norm",
    "decoder_qkv_multiscales": [
      [],
      [],
      [],
      [
        5
      ],
      [
        5
      ],
      [
        5
      ]
    ],
    "downsample_block_type": "Conv",
    "encoder_block_out_channels": [
      128,
      256,
      512,
      512,
      1024,
      1024
    ],
    "encoder_block_types": [
      "ResBlock",
      "ResBlock",
      "ResBlock",
      "EfficientViTBlock",
      "EfficientViTBlock",
      "EfficientViTBlock"
    ],
    "encoder_layers_per_block": [
      2,
      2,
      2,
      3,
      3,
      3
    ],
    "encoder_qkv_multiscales": [
      [],
      [],
      [],
      [
        5
      ],
      [
        5
      ],
      [
        5
      ]
    ],
    "in_channels": 3,
    "latent_channels": 32,
    "scaling_factor": 0.41407,
    "upsample_block_type": "interpolate"
  }
}